Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/consumer_protection/consumer_complaints/financial_services_ombudsman.html.txt.tmx
Source language: en
Languages: ga

source: Making a complaint about a Financial Service Provider
ga: Gearán a dhéanamh faoi soláthróirí seirbhíse airgeadais

source: A financial service provider in Ireland is a firm that deals with saving money, insurance, banking, stockbroking or other financial service
ga: Is cuideachta í soláthraí seirbhíse airgeadais in Éirinn a phléann le coigilt airgid, le hárachas, le baincéireacht, le stocbhróicéireacht nó le seirbhís airgeadais éigin eile

source: If you have a complaint about a financial service provider you should begin by complaining directly to the person that you would normally deal with in the firm
ga: Má tá gearán agat faoi sholáthraí seirbhíse airgeadais, ba cheart duit tosú le gearán a thabhairt go díreach chuig an té ar gnách leat plé leo sa chuideachta féin

source: If you are not satisfied with how your complaint is dealt with you can make a more formal complaint to senior management at the financial service provider
ga: Mura bhfuil tú sásta leis an gcaoi a gcaitear le do ghearán, féadfaidh tú gearán níos foirmiúla a thabhairt chuig lucht bainistíochta sinsearach an tsoláthraí seirbhíse airgeadais

source: The Competition and Consumer Protection Commission provides information on how to complain about financial service providers
ga: Cuir an Ghníomhaireacht Náisiúnta Tomhaltóirí eolas ar fáil ar conas gearán a thabhairt faoi sholáthraithe seirbhíse airgeadais

source: You can read more about effective ways to make a complaint here
ga: Is féidir leat tuilleadh a léamh faoi bhealaí éifeachtacha le gearán a dhéanamh anseo

source: If you are still not satisfied that your complaint is being dealt with fairly by the firm, you may take your complaint to the Financial Services Ombudsman
ga: Mura bhfuil tú sásta fós go bhfuil an chuideachta ag plé go cothrom le do ghearán, féadfaidh tú do ghearán a thabhairt chuig Ombudsman na Seirbhísí Airgeadais

source: The Financial Services Ombudsman Bureau was established under the Central Bank and Financial Services Authority Ireland Act 2004
ga: Bunaíodh Biúró Ombudsman na Seirbhísí Airgeadais faoin Acht um Údarás an Bhainc Cheannais agus na Seirbhísí Airgeadais 2004

source: The Bureau commenced it's work on 1 April 2005
ga: Chuaigh an Biúró i mbun oibre den chéad uair ar 1 Aibreán 2005

source: The Financial Services Ombudsman is an independent officer whose remit is to investigate, mediate and adjudicate unresolved complaints of customers about financial service providers
ga: Is oifigeach neamhspleách é Ombudsman na Seirbhísí Airgeadais arb é a shainchúram ná chun gearáin neamhréitithe na dtomhaltóirí i leith soláthraithe airgeadais a fhiosrú, a idirghabháil agus a bhreithniú

source: The Ombudsman for the Credit Institutions and the Insurance Ombudsman of Ireland schemes are now part of the Financial Services Ombudsman Bureau
ga: Tá scéimeanna an Ombudsman do na hInstitiúidí Creidmheasa agus Ombudsman Árachais na hÉireann mar chuid de Bhiúró Ombudsman na Seirbhísí Airgeadais anois

source: Any complaints that were made to either of these offices before the Bureau was established will be carried forward
ga: Tabharfar ar aghaidh aon ghearán a rinneadh do cheachtar den dá oifig sin sular bunaíodh an Biúró

source: The Office of the Pensions Ombudsman will continue to deal with any complaints about occupational pension schemes or Personal Retirement Savings Accounts (PRSAs)
ga: Leanfaidh Oifig Ombudsman na bPinsean ag plé le haon ghearáin faoi scéimeanna pinsin ghairmiúla nó Cuntais Choigiltis Phearsanta Scoir (PRSA)

source: You should submit a complaint you may have about the way that a scheme is being administered to the Pension Ombudsman
ga: Ba chóir duit gearán a chur isteach a fhéadann a bheith agat faoin gcaoi a bhfuiltear ag riaradh scéim éigin don Ombudsman Pinsin

source: You can read more about Ireland's Pensions Ombudsman here
ga: Is féidir leat tuilleadh a léamh faoi Ombudsman Pinsean na hÉireann anseo

source: Who can complain to the Financial Services Ombudsman’s Bureau?
ga: Cé hiad na dreamanna ar féidir leo gearán a thabhairt chuig Biúró Ombudsman na Seirbhísí Airgeadaisω

source: All personal customers of regulated financial institutions can make complaints to the Financial Services Ombudsman’s Bureau
ga: Is féidir le gach custaiméir pearsanta de chuid na n-institiúidí airgeadais rialaithe gearáin a thabhairt chuig Biúró Ombudsman na Seirbhísí Airgeadais

source: People who have been offered services or have sought the provision of service from the financial institution can also make complaints to the Bureau
ga: Is féidir leis na daoine ar tairgeadh seirbhísí dóibh nó a lorg soláthar seirbhíse ón institiúid airgeadais gearáin a thabhairt chuig an mBiúró freisin

source: The Financial Services Ombudsman’s Bureau will also receive complaints from small businesses (i.e
ga: Glacfaidh Biúró Ombudsman na Seirbhísí Airgeadais le gearáin ó ghnólachtaí beaga freisin (.i

source: companies with an annual turnover of less than 3,000,000 euro)
ga: comhlachtaí le láimhdeachas bliantúil níos lú ná 3,000,000 euro)

source: What companies can the Financial Services Ombudsman’s Bureau investigate?
ga: Cé hiad na comhlachtaí ar féidir le Biúró Ombudsman na Seirbhísí Airgeadais a fhiosrúω

source: The Bureau will investigate complaints against Banks, Building Societies, Credit Unions, Stockbrokers, Insurance Companies (life and non-life), Bureaux de Change, Investment Product Intermediaries, Moneylenders and Designated Investment Companies, Credit Intermediaries (for example, garages that offer finance on new or used cars), Pawnbrokers and Hire Purchase Companies
ga: Fiosróidh an Biúró gearáin i gcoinne na mBanc, na gCumann Foirgníochta, na gComhar Creidmheasa, Stocbhróicéirí, Comhlachtaí Árachais (beatha agus neamhbheatha), Bureaux de Change, Idirghabhálaithe Táirge Infheistíochta, Iasachtóirí Airgid agus Comhlachtaí Infheistíochta ainmnithe, Idirghabhálaithe Creidmheasa (mar shampla, garáistí a thairgeann airgeadas ar charranna úra nó úsáidte), Geallbhróicéirí agus Comhlachtaí Fruilcheannaigh

source: Certain Mortgage Lenders and the VHI may also be investigated by the Bureau if there is a complaint made against them
ga: Is féidir leis an mBiúró Iasachtóirí Morgáiste áirithe agus an VHI a fhiosrú freisin má dhéantar gearán ina gcoinne

source: Since 7 February 2013, it cannot pursue complaints against the Irish Bank Resolution Corporation (IBRC) without the consent of the High Court
ga: Ó 7 Feabhra 2013, ní féidir leis gearáin a shaothrú i gcoinne Chorparáid na hÉireann um Réiteach Bainc (IBRC) gan toiliú na hArd-Chúirte

source: Time limits for making a complaint to the Financial Services Ombudsman
ga: Teorainneacha ama chun ghearán a thabhairt do Ombudsman na Seirbhísí Airgeadais

source: A six year limit applies to all cases so the Ombudsman will not investigate any case arising from events that happened over six years ago
ga: Feidhmíonn teorainn shé bliana do gach cás, ionas nach bhfiosróidh an tOmbudsman aon chás a eascraíonn as eachtraí a tharla ní ba mhó ná sé bliana ó shin

source: The Financial Services Ombudsman Council
ga: Comhairle Ombudsman na Seirbhísí Airgeadais

source: The Ombudsman works under Regulations made by the Financial Services Ombudsman Council with the prior approval of the Minister for Finance
ga: Oibríonn an tOmbudsman faoi Rialacháin a rinne Comhairle Ombudsman na Seirbhísí Airgeadais le ceadú roimhré an Aire Airgeadais

source: The Council appoints the Ombudsman and consists of members of the financial services industry and consumer representatives
ga: Ceapann an Chomhairle an tOmbudsman agus is inti atá baill de thionscal na seirbhísí airgeadais agus ionadaithe tomhaltóirí

source: The Council also prescribes limits on the amount of awards that can be granted
ga: Is í an Chomhairle a fhorordaíonn teorainneacha um méid na dámhachtainí ar féidir a bhronnadh

source: The Ombudsman can make awards up to certain limits (250,000 euro)
ga: Is féidir leis an Ombudsman dámhachtainí a dhéanamh suas go dtí teorainneacha áirithe (250,000 euro)

source: Awards are binding on both parties
ga: Bíonn na dámhachtainí ceangailteach ar an dá pháirtí

source: These awards can however, be appealed to the High Court by either the financial institution or the consumer who took the complaint
ga: . Is féidir leis an institiúid airgeadais nó an tomhaltóir a rinne an gearán achomharc a thabhairt chuig an Ard-Chúirt in aghaidh na ndámhachtainí seo

source: Services from the Financial Services Ombudsman Bureau are free
ga: Tá na seirbhísí ó Bhiúró Ombudsman na Seirbhísí Airgeadais saor in aisce

source: If you lose your case, you won't have to pay any charges to the Bureau or to the financial services provider against which you took your claim
ga: Má chailleann tú do chás, ní bheidh ort aon mhuirir a íoc leis an mBiúró ná le soláthraí na seirbhísí airgeadais ar thug tú d'éileamh ina choinne

source: You may engage a solicitor or any other professional to help you with your application to the Bureau
ga: Féadfaidh tú aturnae nó gairmí éigin eile a fhostú chun cuidiú leat le d'iarratas chuig an mBiúró

source: Costs associated with hiring a professional under these circumstances are your own responsibility
ga: Is é do chúram féin iad na costais a bhaineann le gairmí a fhostú faoi na cúinsí seo

source: If you have a complaint about a financial service provider you are advised to take the following steps:
ga: Má bhíonn gearán agat faoi sholáthraí seirbhíse airgeadais, moltar duit na céimeanna seo a leanas a ghlacadh:

source: • Make a complaint first of all to the person who you normally deal with at the bank, building society, insurance company or other financial service provider
ga: • Déan do ghearán sa chéad dul síos chuig an té a bpléann tú go hiondúil leo ag an mbanc, an cumann foirgníochta, an comhlacht árachais nó soláthraí seirbhíse airgeadais

source: • If you are not satisfied with the response from the financial service provider, you should put your complaint in writing, addressing the letter to their senior management
ga: • Mura bhfuil tú sásta leis an bhfreagra ón soláthraí seirbhíse airgeadais, ba cheart duit do ghearán a chur i bhfoirm scríbhinne, leis an litir seolta chuig an lucht bainistíochta sinsearach

source: (Contact details should be available from the bank or by looking at their website)
ga: (Ba chóir go mbeadh sonraí teagmhála ar fáil ón mbanc nó trí fhéachaint ar a suíomh gréasáin).

source: • If you are still unsatisfied, you may take your complaint to the Financial Services Ombudsman’s Bureau
ga: • Má tá tú míshásta go fóill, féadfaidh tú do ghearán a thabhairt chuig Biúró Ombudsman na Seirbhísí Airgeadais

source: The Financial Services Ombudsman has developed a guide for complainants here
ga: Tá Ombudsman na Seirbhísí Airgeadais tar éis treoir a fhorbairt do ghearánaithe anseo

source: You may download an application form to commence proceedings with the Bureau here
ga: Féadfaidh tú foirm iarratais a íoslódáil chun imeachtaí a thionscnamh leis an mBiúró anseo

source: Remember, the Financial Services Ombudsman will only take on a case after the formal complaints mechanism of the financial institution has been exhausted
ga: Cuimhnigh nach nglacfaidh Ombudsman na Seirbhísí Airgeadais le cás ach amháin tar éis d'ídiú mheicníocht na ngearán foirmiúil de chuid na hinstitiúide airgeadais
